Jokes/app/controllers/jokes_controller.rb

  def index
    @jokes = Joke.all
---
SELECT "jokes".* FROM "jokes"

  def in_like
    current_like = Joke.find(params[:id])
    current_like.like +=1
    current_like.save
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "jokes" SET "like" = ?, "updated_at" = ? WHERE "jokes"."id" = ?  [["like", 23], ["updated_at", "2024-04-01 18:44:21.842378"], ["id", 3]]

  def in_dislike
    current_like = Joke.find(params[:id])
    current_like.dislike +=1
    current_like.save
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "jokes" SET "dislike" = ?, "updated_at" = ? WHERE "jokes"."id" = ?  [["dislike", 57], ["updated_at", "2024-04-01 18:44:14.465342"], ["id", 2]]

  def set_joke
    @joke = Joke.find(params[:id])
---
SELECT "jokes".* FROM "jokes" WHERE "jokes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]